#### ConnectionValidationWarning Members

---

|  |
| --- |
| ConnectionValidationWarning Class   Constructors   Methods   Properties   See Also |

The  ConnectionValidationWarning  type exposes the following members.

# Constructors

|  | Name | Description |
| --- | --- | --- |
| Public method | ConnectionValidationWarning | Constructor. |

# Methods

|  | Name | Description |
| --- | --- | --- |
| Public method | Dispose | Releases all resources used by the  ConnectionValidationWarning |
| Public method | Equals | Determines whether the specified  Object  is equal to the current  Object  . (Inherited from  Object  .) |
| Public method | GetHashCode | Serves as a hash function for a particular type. (Inherited from  Object  .) |
| Public method | GetParts | Get ElementIds of affected parts. |
| Public method | GetType | Gets the  Type  of the current instance. (Inherited from  Object  .) |
| Public method | ToString | Returns a string that represents the current object. (Inherited from  Object  .) |

# Properties

|  | Name | Description |
| --- | --- | --- |
| Public property | IsValidObject | Specifies whether the .NET object represents a valid Revit entity. |
| Public property | Reason | Enumeration for reason of warning. |
| Public property | Resolution | Enumeration for resolution that was applied. |

# See Also

ConnectionValidationWarning Class

Autodesk.Revit.DB Namespace